cf/Catalogs/Функции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Функции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конфигурации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеИнструкции</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечнаяФункция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеСПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аббревиатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ТипыФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТехническоеОписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнструкцияПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Функции/Forms/СписокФункций/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ (Поле.Имя = "ТехническоеОписание" ИЛИ Поле.Имя = "ИнструкцияПользователя") Тогда
		Возврат;
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь;
	
	Файл = Элементы.Список.ТекущиеДанные[Поле.Имя];
	ИмяФайла = ТИ.ПолучитьПолноеОписаниеФайла(Файл);
	
	Адрес = ПолучитьФайлНаСервере(Файл, УникальныйИдентификатор);
	
	ПолучитьФайл(Адрес, ИмяФайла);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФайлНаСервере(Файл, УникальныйИдентификатор)

	Возврат ПоместитьВоВременноеХранилище(Файл.ХранилищеФайла.Получить(), УникальныйИдентификатор);

КонецФункции // ПолучитьФайлНаСервере()

&НаКлиенте
Процедура ОтправитьСсылкуНаИнструкциюПоПочте(Команда)
	
	ТипФайла = ПредопределенноеЗначение("Перечисление.ТипыФайлов.ИнструкцияПользователя");
	
	ФункцияСсылка = Элементы.Список.ТекущиеДанные.Ссылка;
	Файл = ТИ.ПолучитьФайлФункцииНаСервере(ФункцияСсылка, ТипФайла);
	Если Файл = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден файл "+ТипФайла;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", 
      ЭтотОбъект, Файл);	
 
    ПоказатьВводЗначения(
        Оповещение,
        , // пропускаем начальное значение
        "Выберите адресата",
        ОписаниеТипов
    );
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт

	Физлицо = Результат;
	Файл = Параметры;
	Если Не Результат = Неопределено Тогда
		АдресЭлектроннойПочты = ТИ.ПолучитьРеквизитПоСсылке(Физлицо,"АдресЭлектроннойПочты");
		Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для данного физ. лица не задан адрес электронной почты.";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		ШаблонСообщения = ПредопределенноеЗначение("Справочник.ШаблоныСообщений.СсылкаНаИнструкцию");
		
		ТИ.СформироватьИОтправитьУведомление(Файл, ШаблонСообщения, АдресЭлектроннойПочты);
	КонецЕсли;
	
	ПоказатьОповещениеПользователя("Сообщение подготовлено и будет отправлено в течении 5 минут.");
	
КонецПроцедуры // ПослеВводаЗначения()

&НаКлиенте
Процедура Инструкции(Команда)
	Форма = ОткрытьФорму("Справочник.Функции.Форма.СписокИнструкций");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ (ТИ.ДоступнаРоль("ПолныеПрава") ИЛИ ТИ.ДоступнаРоль("Разработчик")) Тогда
		
		Форма = ОткрытьФорму("Справочник.Функции.Форма.СписокИнструкций");
		Отказ = Истина;
	
	КонецЕсли; 
	
КонецПроцедуры
